SOAPWebserver/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://cmpt436/soap-web-service/productcatalog">
    <soapenv:Header/>
    <soapenv:Body>
<!--        <gs:addProductRequest>-->
<!--            <gs:product>-->
<!--                <gs:name>Product1</gs:name>-->
<!--                <gs:price>19.99</gs:price>-->
<!--                <gs:description>My first Product</gs:description>-->
<!--                <gs:imageEncoding>null</gs:imageEncoding>-->
<!--            </gs:product>-->
<!--        </gs:addProductRequest>-->

<!--        <gs:updateProductRequest>-->
<!--            <gs:id>2</gs:id>-->
<!--            <gs:product>-->
<!--                <gs:name>product2</gs:name>-->
<!--                <gs:price>39.99</gs:price>-->
<!--                <gs:description>My second product</gs:description>-->
<!--                <gs:imageEncoding>null</gs:imageEncoding>-->
<!--            </gs:product>-->
<!--        </gs:updateProductRequest>-->

<!--        <gs:getProductRequest>-->
<!--            <gs:id>2</gs:id>-->
<!--        </gs:getProductRequest>-->

        <gs:getAllProductsRequest>
        </gs:getAllProductsRequest>
    </soapenv:Body>
</soapenv:Envelope>
